import React from 'react'

const Jobduties = () => {
    return (
        <>
            <ul className="flex flex-wrap items-center justify-center gap-y-5 text-[#898989]">
                <li className="w-[25rem] md:w-[87rem]">
                    <h3 className="text-[1.88438rem] font-[600]">موقعیت:</h3>
                    <p className="text-[1.61938rem] font-[500] ">
                        • لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                        استفاده از طراحان گرافیک است چاپگرها و متون بلکه <br /> روزنامه و
                        مجله در ستون و سطرآنچنان که لازم است.
                    </p>
                    <p className="text-[1.61938rem] font-[500] ">
                        • لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
                    </p>
                    <p className="text-[1.61938rem] font-[500] ">
                        • طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و
                        سطرآنچنان که لازم است.
                    </p>
                </li>
                <li className="w-[25rem] md:w-[87rem] ">
                    <h3 className="text-[1.88438rem] font-[600]">شرح وظایف:</h3>
                    <p className="text-[1.61938rem] font-[500]">
                        • لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                        استفاده از طراحان گرافیک است چاپگرها و متون بلکه <br /> روزنامه و
                        مجله در ستون و سطرآنچنان که لازم است.
                    </p>
                    <p className="text-[1.61938rem] font-[500]">
                        • لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
                    </p>
                    <p className="text-[1.61938rem] font-[500]">
                        • طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و
                        سطرآنچنان که لازم است.
                    </p>
                </li>
                <li className="w-[25rem] md:w-[87rem] ">
                    <h3 className="text-[1.88438rem] font-[600]">انتظارات:</h3>
                    <p className="text-[1.61938rem] font-[500]">
                        • لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
                        استفاده از طراحان گرافیک است چاپگرها و متون بلکه <br /> روزنامه و
                        مجله در ستون و سطرآنچنان که لازم است.
                    </p>
                    <p className="text-[1.61938rem] font-[500]">
                        • لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
                    </p>
                    <p className="text-[1.61938rem] font-[500]">
                        • طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و
                        سطرآنچنان که لازم است.
                    </p>
                </li>
            </ul>
        </>
    )
}

export default Jobduties